// Provided under the GPL v2 license. See the included LICENSE.txt for details.

#include <stdio.h>
#include <stdlib.h>
#include <string.h>
#include <unistd.h>
#include <assert.h>
#include <stdint.h>
#include <stdarg.h>
#include <ctype.h>

//      7800header - a simple app to generate/interrogate a a78 header.
//                      Michael Saarna (aka RevEng@AtariAge)

#define HEADER_VERSION_INFO "7800header 0.21"

void usage (char *binaryname);
uint32_t phtole32 (uint32_t value);
void loadfile (char *filename);
void report (void);
void setupheaderdefaults (void);
void setunset (char *command);
int checkset (char *option, int typemask);
void clearbasemappers (void);
void syncheader (void);
void writea78 (char *filename);
void writebin (char *filename);
void prerror (char *format, ...);
void prwarn (char *format, ...);
void trimnewline (char *string);

struct header7800
{

    unsigned char version;	//0

    char console[16];		//1-16

    char gamename[32];		//17-48

    unsigned char romsize1;	//49
    unsigned char romsize2;	//50
    unsigned char romsize3;	//51
    unsigned char romsize4;	//52

    // deprecated bytes in v4...
    unsigned char carttype1;	//53
    unsigned char carttype2;	//54

    unsigned char controller1;	//55
    unsigned char controller2;	//56

    unsigned char tvformat;	//57
    unsigned char saveperipheral;	//58

    unsigned char unused1[3];	//59-61

    // deprecated bytes in v4...
    unsigned char irq;		//62

    unsigned char xm;		//63

    // v4 cart hardware bytes
    unsigned char mapper;	//64
    unsigned char mapper_options;	//65
    unsigned char audio1;	//66
    unsigned char audio2;	//67
    unsigned char interrupt1;	//68
    unsigned char interrupt2;	//69

    unsigned char unused2[30];	//70-99

    char headertext[28];	//100-127
} myheader;

long gamesize;
uint32_t headergamesize;
char *rombuffer;

int v3only = 0;
int v4only = 0;
int overwrite = 0;
int printinfo = 0;
char filename[1024];

int main (int argc, char **argv)
{
    FILE *in;
    char usercommand[1024];
    int c;
    opterr = 0;


    fprintf (stderr, "\n%s %s %s\n", HEADER_VERSION_INFO, __DATE__, __TIME__);

    assert (sizeof (myheader) == 128);

    if ((argc < 2) || (argv[argc - 1][0] == '-'))
	usage (argv[0]);
    strncpy (filename, argv[argc - 1], 1024);

    in = fopen (filename, "rb");
    if (in == NULL)
	prerror ("Couldn't open '%s' for reading.\n", filename);

    //open the file and get the size...
    fseek (in, 0, SEEK_END);
    gamesize = ftell (in);
    fseek (in, 0, SEEK_SET);	//rewind

    if (gamesize == 0)
	prerror ("The file size of %s is 0 bytes.\n", filename);

    if (gamesize > 128)
	fread (&myheader, 1, 128, in);
